'''
문자열 형식으로 입력받은 모스 부호(dot : . dash : -)를 해독하여
영어 문장으로 출력하는 프로그램을 작성해보자.

글자와 글자 사이는 공백 1개, 단어와 단어 사이는 공백 2개로 구분한다.
예를 들어 다음 모스부호는 'HE SLEEPS EARLY'로 해석해야 한다.
.... .  ... .-.. . . .--. ...  . .- .-. .-.. -.--

모스 부호 규칙 표
A .-	  N -.
B -...	  O ---
C -.-. 	  P .--.
D -.. 	  Q --.-
E . 	  R .-.
F ..-. 	  S ...
G --. 	  T -
H .... 	  U ..-
I .. 	  V ...-
J .---    W .--
K -.- 	  X -..-
L .-.. 	  Y -.--
M -- 	  Z --..
'''

morse_dic = {
'.-'   : 'A', '-...' : 'B', '-.-.' : 'C', '-..'  : 'D', '.'    : 'E',
'..-.' : 'F', '--.'  : 'G', '....' : 'H', '..'   : 'I', '.---' : 'J',
'-.-'  : 'K', '.-..' : 'L', '--'   : 'M', '-.'   : 'N', '---'  : 'O',
'.--.' : 'P', '--.-' : 'Q', '.-.'  : 'R', '...'  : 'S', '-'    : 'T',
'..-'  : 'U', '...-' : 'V', '.--'  : 'W', '-..-' : 'X', '-.--' : 'Y',
'--..' : 'Z'
}

def morse_to_string(morse) :
	result = []

	for word in morse.split('  ') :
		for char in word.split(' ') :
			result.append(morse_dic[char])

		result.append(' ')

	return ''.join(result)

print(morse_to_string('.... .  ... .-.. . . .--. ...  . .- .-. .-.. -.--')) # 'HE SLEEPS EARLY'
