# 리스트
# 여러 가지 리스트의 표현
odd = [1, 3, 5, 7, 9]
a =[] # 비어있는 리스트
b = [1, 2, 3]
c = ['Life', 'is', 'too', 'short']
d = [1, 2, 'Life', 'is']
e = [1, 2, ['Life', 'is']]

# 리스트 인덱싱
a = [1, 2, 3]
a # [1, 2, 3]
a[0] # 1
a[0] + a[2] # 4
a[-1] # 3
a = [1, 2, 3, ['a', 'b', 'c']]
a[0] # 1
a[-1] # ['a', 'b', 'c']
a[3] # ['a', 'b', 'c']
a[-1][0] # 'a'
a[-1][1] # 'b'
a[-1][2] # 'c'

# 삼중 리스트에서 인덱싱하기
a = [1, 2, ['a', 'b', ['Life', 'is']]]
a[2][2][0] # 'Life'

# 리스트의 슬라이싱
a = [1, 2, 3, 4, 5]
a[0:2] # [1, 2]
a = "12345"
a[0:2] # '12'
# 문자열에서 사용하는 슬라이싱 방법과 동일하다.

a = [1, 2, 3, 4, 5]
b = a[:2]
c = a[2:]
b # [1, 2]
c # [3, 4, 5]

# 중첩된 리스트에서 슬라이싱하기
a = [1, 2, 3, ['a', 'b', 'c'], 4, 5]
a[2:5] # [3, ['a', 'b', 'c'], 4]
a[3][:2] # ['a', 'b']

# 리스트 더하기(+)
a = [1, 2, 3]
b = [4, 5, 6]
a + b # [1, 2, 3, 4, 5, 6]

# 리스트 반복하기(*)
a = [1, 2, 3]
a * 3 # [1, 2, 3, 1, 2, 3, 1, 2, 3]

# 초보자가 범하기 쉬운 리스트 연산 오류
a = [1, 2, 3]
# a[2] + "hi" Error
str(a[2]) + "hi"

# 리스트에서 하나의 값 수정하기
a = [1, 2, 3]
a[2] = 4
a # [1, 2, 4]

# 리스트에서 연속된 범위의 값 수정하기
a = [1, 2, 4]
a[1:2] # [2]
a[1:2] = ['a', 'b', 'c']
a # [1, 'a', 'b', 'c', 4]

# [] 사용해 리스트 요소 삭제하기
a[1:3] = []
a # [1, 'c', 4]

# del 함수 사용해 리스트 요소 삭제하기
a = [1, 'c', 4]
a # [1, 'c', 4]
del a[1]
a # [1,4]

# 리스트에 요소 추가
a = [1, 2, 3]
a.append(4)
a # [1, 2, 3, 4]
a.append([5, 6])
a # [1, 2, 3, 4, [5, 6]]

# 리스트 정렬
a = [1, 4, 3, 2]
a.sort()
a # [1, 2, 3, 4]
a = ['a', 'c', 'b']
a.sort()
a # ['a', 'b', 'c']

# 리스트 뒤집기
a = ['a', 'c', 'b']
a.reverse()
a # ['b', 'c', 'a']

# 위치 반환
a = [1, 2, 3]
a.index(3) # 2
a.index(1) # 0
# a.indxe(0) Error

# 리스트에 요소 삽입
a = [1, 2, 3]
a.insert(0, 4) # [4, 1, 2, 3]
a.insert(3, 5) # [4, 1, 2, 5, 3]

# 리스트 요소 제거
a = [1, 2, 3, 1, 2, 3]
a.remove(3) # [1, 2, 1, 2, 3]
a.remove(3) # [1, 2, 1, 2]

# 리스트 요소 끄집어내기
a = [1, 2, 3]
a.pop() # 3
a # [1, 2]
a = [1, 2, 3]
a.pop(1) # 2
a # [1, 3]

# 리스트에 포함된 요소 x의 개수 세기
a = [1, 2, 3, 1]
a.count(1) # 2

# 리스트 확장
a = [1, 2, 3]
a.extend([4, 5])
a # [1, 2, 3, 4, 5]
b = [6, 7]
a.extend(b)
a # [1, 2, 3, 4, 5, 6, 7]
